of222/tutorials/rheoEFoam/channelEDF/PowerLaw/PoissonBoltzmann/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat raw;

surfaceFormat raw;

formatOptions
{
    ensight
    {
        format  ascii;
    }
}

interpolationScheme cellPointFace;

fields
(
   U  
);

sets
(

    lineY
    {
        type        face;
        axis        y;

        start       ( 7.5e-6 -1e-6 5e-6 );
        end         ( 7.5e-6 100e-6 5e-6 );
       
    }
 
);

surfaces
(

);

